/* 주석 */
// 한줄주석
/* 여러줄 주석 */

package Day01; // 현재 소스파일이 위치한 패키지명

public class Ex1 { 
	// public : 사용범위. [ 프로젝트내 모든 곳 사용 ]
	// class : 클래슷 선언
	// Ex1 : 클래스명[아무거나] 첫글자는 대문자로
	public static void main(String[] args) { // main함수 : 메인쓰레드를 가지고 있는 함수
		System.out.println("자바자바자바");         // 코드 -----> 프로세스 -----> 프로그램
	}
	
}
/*
	
	실제 존재하는 모든것 ----------------> 코드
	 공기 , 돈 , 사람 등등등...				객체지향 언어
	 [ 성질 , 행동 ]
	
	
	
	자바 : 100% 객체지향언어 
 		객체 : 객체지향 생성하기 위한 미리 정의된 틀/설계도
		클래스 : 클래스 기반으로 만들어진 식별가능한 메모리/형태
		객체지향 : [OOP] 객체들을 모아서 만든 프로그램
 */